stm32duino/Arduino_Core_STM32/system/Drivers/STM32WB0x_HAL_Driver/Inc/stm32wb0x_ll_bus.h
/**
  ******************************************************************************
  * @file    stm32wb0x_ll_bus.h
  * @author  MCD Application Team
  * @brief   Header file of BUS LL module.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2024 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  @verbatim
                      ##### RCC Limitations #####
  ==============================================================================
    [..]
      A delay between an RCC peripheral clock enable and the effective peripheral
      enabling should be taken into account in order to manage the peripheral read/write
      from/to registers.
      (+) This delay depends on the peripheral mapping.
        (++) AHB & APB peripherals, 1 dummy read is necessary

    [..]
      Workarounds:
      (#) For AHB & APB peripherals, a dummy read to the peripheral register has been
          inserted in each LL_{BUS}_GRP{x}_EnableClock() function.

  @endverbatim
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef STM32WB0x_LL_BUS_H
#define STM32WB0x_LL_BUS_H

#ifdef __cplusplus
extern "C" {
#endif /* __cplusplus */

/* Includes ------------------------------------------------------------------*/
#include "stm32wb0x.h"

/** @addtogroup STM32WB0x_LL_Driver
  * @{
  */

#if defined(RCC)


/** @defgroup BUS_LL BUS
  * @{
  */

/* Private types -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/

/* Private constants ---------------------------------------------------------*/

/* Private macros ------------------------------------------------------------*/

/* Exported types ------------------------------------------------------------*/

/* Exported constants --------------------------------------------------------*/
/** @defgroup BUS_LL_Exported_Constants BUS Exported Constants
  * @{
  */

/** @defgroup BUS_LL_AHB1_GRP1_PERIPH  AHB PERIPH
  * @{
  */
#define LL_AHB1_GRP1_PERIPH_ALL            (RCC_AHBENR_DMAEN|  \
                                            RCC_AHBENR_GPIOAEN|\
                                            RCC_AHBENR_GPIOBEN|\
                                            RCC_AHBENR_CRCEN|  \
                                            RCC_AHBENR_PKAEN|  \
                                            RCC_AHBENR_RNGEN)
#define LL_AHB1_GRP1_PERIPH_DMA            RCC_AHBENR_DMAEN
#define LL_AHB1_GRP1_PERIPH_GPIOA          RCC_AHBENR_GPIOAEN
#define LL_AHB1_GRP1_PERIPH_GPIOB          RCC_AHBENR_GPIOBEN
#define LL_AHB1_GRP1_PERIPH_CRC            RCC_AHBENR_CRCEN
#if defined(PKA)
#define LL_AHB1_GRP1_PERIPH_PKA            RCC_AHBENR_PKAEN
#endif
#define LL_AHB1_GRP1_PERIPH_RNG            RCC_AHBENR_RNGEN

/**
  * @}
  */

/** @defgroup BUS_LL_APB0_GRP1_PERIPH  APB0 PERIPH
  * @{
  */
#if defined(STM32WB06) || defined(STM32WB07)
#define LL_APB0_GRP1_PERIPH_ALL            (RCC_APB0ENR_TIM1EN|RCC_APB0ENR_SYSCFGEN|RCC_APB0ENR_RTCEN|RCC_APB0ENR_WDGEN)
#elif defined(STM32WB05) || defined(STM32WB09)
#define LL_APB0_GRP1_PERIPH_ALL            (RCC_APB0ENR_TIM2EN|   \
                                            RCC_APB0ENR_TIM16EN|  \
                                            RCC_APB0ENR_TIM17EN|  \
                                            RCC_APB0ENR_SYSCFGEN| \
                                            RCC_APB0ENR_RTCEN|    \
                                            RCC_APB0ENR_WDGEN)
#endif
#if defined(TIM1)
#define LL_APB0_GRP1_PERIPH_TIM1           RCC_APB0ENR_TIM1EN
#endif
#if defined(TIM2)
#define LL_APB0_GRP1_PERIPH_TIM2           RCC_APB0ENR_TIM2EN
#endif
#if defined(TIM16)
#define LL_APB0_GRP1_PERIPH_TIM16          RCC_APB0ENR_TIM16EN
#endif
#if defined(TIM17)
#define LL_APB0_GRP1_PERIPH_TIM17          RCC_APB0ENR_TIM17EN
#endif
#define LL_APB0_GRP1_PERIPH_SYSCFG         RCC_APB0ENR_SYSCFGEN
#define LL_APB0_GRP1_PERIPH_RTC            RCC_APB0ENR_RTCEN
#define LL_APB0_GRP1_PERIPH_WDG            RCC_APB0ENR_WDGEN

/**
  * @}
  */


/** @defgroup BUS_LL_APB1_GRP1_PERIPH  APB1 PERIPH
  * @{
  */
#if defined(STM32WB06) || defined(STM32WB07)
#define LL_APB1_GRP1_PERIPH_ALL            (RCC_APB1ENR_SPI1EN    |\
                                            RCC_APB1ENR_ADCDIGEN  |\
                                            RCC_APB1ENR_ADCANAEN  |\
                                            RCC_APB1ENR_LPUARTEN  |\
                                            RCC_APB1ENR_USARTEN   |\
                                            RCC_APB1ENR_SPI2EN    |\
                                            RCC_APB1ENR_SPI3EN    |\
                                            RCC_APB1ENR_I2C1EN    |\
                                            RCC_APB1ENR_I2C2EN)

#define LL_APB1_GRP1_RESET_PERIPH_ALL      (RCC_APB1ENR_SPI1EN    |\
                                            RCC_APB1ENR_ADCDIGEN  |\
                                            RCC_APB1ENR_LPUARTEN  |\
                                            RCC_APB1ENR_USARTEN   |\
                                            RCC_APB1ENR_SPI2EN    |\
                                            RCC_APB1ENR_SPI3EN    |\
                                            RCC_APB1ENR_I2C1EN    |\
                                            RCC_APB1ENR_I2C2EN)

#elif defined(STM32WB05) || defined(STM32WB09)
#define LL_APB1_GRP1_PERIPH_ALL            (RCC_APB1ENR_ADCDIGEN |\
                                            RCC_APB1ENR_ADCANAEN |\
                                            RCC_APB1ENR_LPUARTEN |\
                                            RCC_APB1ENR_USARTEN  |\
                                            RCC_APB1ENR_SPI3EN   |\
                                            RCC_APB1ENR_I2C1EN)

